{
  "category": "path",
  "path_id": "survival",
  "path_name": "Survival",
  "description": "Those who thrive where others perish. Hunters, scouts, and trackers who endure the wilds through instinct, adaptation, and relentless focus.",
  
  "talents": [
    {
      "id": "hunter",
      "name": "Hunter",
      "max_rank": 10,
      "is_primary": true,
      "prerequisites": {"Wisdom": 15, "secondary": {"Endurance": 15, "Intellect": 15, "Agility": 15, "prereq_type": "or"}},
      "requires_choice": true,
      "choice_type": "creature_types",
      "description": "You read the rhythm of your prey, no movement, scent, or sound escapes your notice.",
      "ranks": {
        "1": "Choose two creature types as your primary prey. You deal +1d6 damage when striking your chosen prey.",
        "2": "Damage against prey increases to +2d6.",
        "3": "Gain advantage on Perception and Survival checks to track or detect your prey. +1 to attack rolls against prey.",
        "4": "Damage against prey increases to +3d6.",
        "5": "Choose a third creature type as prey. You can sense your prey within 60 ft (general direction only).",
        "6": "Damage against prey increases to +4d6. Your prey cannot hide from you within 30 ft.",
        "7": "Gain +2 to Defense when fighting your prey.",
        "8": "Damage against prey increases to +5d6. First attack each turn against prey has advantage.",
        "9": "Choose a fourth creature type. You can sense all prey creatures within 120 ft.",
        "10": "Ultimate Hunter: Damage against prey increases to +6d6. Once per long rest, mark a creature (any type) as prey for 24 hours. All your attacks against that creature have advantage and deal maximum damage on the first hit."
      }
    },
    {
      "id": "adapt_explorer",
      "name": "Adapt Explorer",
      "max_rank": 3,
      "prerequisites": {"Endurance": 12},
      "description": "Your body and instincts adjust to any terrain or element, thriving where others struggle.",
      "ranks": {
        "1": "Ignore difficult terrain and gain advantage on Survival checks.",
        "2": "Gain resistance to environmental damage (heat, cold, acid, or similar natural hazards).",
        "3": "Once per day, for 1 hour, you and allies within 30 ft gain the benefits of Ranks 1 and 2."
      }
    },
    {
      "id": "agile_protector",
      "name": "Agile Protector",
      "max_rank": 3,
      "prerequisites": {"Agility": 12},
      "description": "You use motion as defense, weaving between strikes and protecting allies through movement.",
      "ranks": {
        "1": "When missed by a melee attack, you may move up to 10 ft without provoking opportunity attacks.",
        "2": "As a Reaction, you may impose disadvantage on a melee attack targeting an ally if their attacker is within 5 ft of you.",
        "3": "Once per short rest, when an ally within 10 ft is hit, you may take the damage instead and move both yourself and the ally up to 10 ft."
      }
    },
    {
      "id": "beast_bond",
      "name": "Beast Bond",
      "max_rank": 3,
      "prerequisites": {"Wisdom": 13},
      "description": "You forge a connection with beasts through shared instinct and trust.",
      "ranks": {
        "1": "You can calm or command beasts with a successful Wisdom (Taming) check.",
        "2": "You gain a loyal beast companion (CR ≤ half your level) that obeys simple verbal or mental commands.",
        "3": "Your companion's attacks count as magical. It gains HP equal to your level and +2 to all saves. You can communicate telepathically within 1 mile."
      }
    },
    {
      "id": "defensive_footwork",
      "name": "Defensive Footwork",
      "max_rank": 3,
      "prerequisites": {"Agility": 13},
      "description": "Balanced footing and precision guard you where armor cannot.",
      "ranks": {
        "1": "When you take the Dodge action, add your AGL modifier to your Defense again until the start of your next turn.",
        "2": "Once per short rest, you may use Dodge as a Bonus Action instead of a full action.",
        "3": "When using Dodge, gain +2 to all saving throws. Enemies have disadvantage on opportunity attacks against you."
      }
    },
    {
      "id": "trackers_instinct",
      "name": "Tracker's Instinct",
      "max_rank": 3,
      "prerequisites": {"Wisdom": 13},
      "description": "You sense trails, deception, and danger even when sight and sound fail.",
      "ranks": {
        "1": "Gain advantage on Perception and Insight checks, you are now trained in them.",
        "2": "Once per short rest, you may detect hidden creatures within 10 ft even if they are hidden by magic.",
        "3": "Once per short rest, instantly identify the direction and approximate distance of a creature you have tracked before."
      }
    },
    {
      "id": "wilderness_adaptation",
      "name": "Wilderness Adaptation",
      "max_rank": 3,
      "prerequisites": {"Endurance": 12, "Wisdom": 12, "prereq_type": "or"},
      "description": "Your senses and instincts evolve to thrive in harsh and unpredictable environments.",
      "ranks": {
        "1": "Gain advantage on Survival checks to detect natural hazards such as quicksand, unstable ground, poisonous plants, or weak ice.",
        "2": "Gain resistance to natural poisons and venoms; on a successful save against poison, take no damage.",
        "3": "You and allies within 10 ft cannot become lost except by magical means. Gain advantage on all saves against environmental effects."
      }
    },
    {
      "id": "master_of_survival",
      "name": "Master of Survival",
      "max_rank": 1,
      "is_capstone": true,
      "prerequisites": {"all_path_talents": true},
      "description": "You have become one with the natural order, a predator, guardian, and force of balance.",
      "ranks": {
        "1": "You cannot be tracked by nonmagical means. Automatically detect ambushes and traps within 20 ft. Once per short rest, when you or an ally within 15 ft fails a saving throw, force a reroll. Once per long rest, if you or your beast companion would be reduced to 0 LP, you both instead regain all LP and 1 HP instead. Your movement cannot be reduced by terrain, weather, or restraints smaller than your size category."
      }
    }
  ]
}
